bookRecommender_Backend/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "John"], ["created_at", "2018-02-12 17:57:00.702770"], ["updated_at", "2018-02-12 17:57:00.702770"]]
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "hello"], ["LIMIT", 1]]
---
  def create
    @user = User.find_or_create_by(name: params[:name])

INSERT INTO "user_books" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["book_id", 2], ["created_at", "2018-02-12 17:59:42.422265"], ["updated_at", "2018-02-12 17:59:42.422265"]]
SELECT  "books".* FROM "books" WHERE "books"."googleId" = ? LIMIT ?  [["googleId", "YpilngEACAAJ"], ["LIMIT", 1]]
SELECT  1 AS one FROM "books" INNER JOIN "user_books" ON "books"."id" = "user_books"."book_id" WHERE "user_books"."user_id" = ? AND "books"."id" = ? LIMIT ?  [["user_id", 8], ["id", 4], ["LIMIT", 1]]
SELECT "books".* FROM "books" INNER JOIN "user_books" ON "books"."id" = "user_books"."book_id" WHERE "user_books"."user_id" = ?  [["user_id", 1]]
---
  def postBook
    @book = Book.find_or_create_by(googleId: params[:googleId])
    if @user.books.include?(@book)

SELECT  "user_books".* FROM "user_books" WHERE "user_books"."user_id" = ? AND "user_books"."book_id" = ? LIMIT ?  [["user_id", 1], ["book_id", 1], ["LIMIT", 1]]
DELETE FROM "user_books" WHERE "user_books"."id" = ?  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def deleteBook
    @user_book = UserBook.find_by(user_id: params[:userId], book_id: params[:id])
    UserBook.destroy(@user_book.id)
    @user = User.find(params[:userId])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_user
    @user = User.find_by(id: params[:id])